Revit 2027 API
DuctSettings.OvalDuctSizeSuffix Property
 The oval duct size suffix string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OvalDuctSizeSuffix { get; set; }
Public Property OvalDuctSizeSuffix As String
	Get
	Set
public:
property String^ OvalDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
member OvalDuctSizeSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace